In [1]:
import pandas as pd

In [2]:
pd.DataFrame({
    "col1" : [1,2,3,4,5],
    "col2" : [45,56,67,34,34],
    "col3" : "sudhansu kumar Sumay Krish naik ineuron"
})

   col1  col2                                     col3
0     1    45  sudhansu kumar Sumay Krish naik ineuron
1     2    56  sudhansu kumar Sumay Krish naik ineuron
2     3    67  sudhansu kumar Sumay Krish naik ineuron
3     4    34  sudhansu kumar Sumay Krish naik ineuron
4     5    34  sudhansu kumar Sumay Krish naik ineuron

In [3]:
df = pd.DataFrame({
    "col1" : [1,2,3,4,5],
    "col2" : [45,56,67,34,34],
    "col3" : "sudhansu kumar sumay Krish naik".split()
})

In [4]:
df

   col1  col2      col3
0     1    45  sudhansu
1     2    56     kumar
2     3    67     sumay
3     4    34     Krish
4     5    34      naik

In [5]:
df["col4"] = df["col1"] ** 2

In [6]:
df

   col1  col2      col3  col4
0     1    45  sudhansu     1
1     2    56     kumar     4
2     3    67     sumay     9
3     4    34     Krish    16
4     5    34      naik    25

In [7]:
df["col5"] = df["col3"].str[0]

In [8]:
df

   col1  col2      col3  col4 col5
0     1    45  sudhansu     1    s
1     2    56     kumar     4    k
2     3    67     sumay     9    s
3     4    34     Krish    16    K
4     5    34      naik    25    n

In [9]:
# this is the anothere way to gett square

def test(a):
    return a**2

In [10]:
df["col4_4"] = df["col1"].apply(test)

In [11]:
df

   col1  col2      col3  col4 col5  col4_4
0     1    45  sudhansu     1    s       1
1     2    56     kumar     4    k       4
2     3    67     sumay     9    s       9
3     4    34     Krish    16    K      16
4     5    34      naik    25    n      25

In [13]:
# now i have to create a column col_5 in which 
# the in first word should be "s" remain "s" else write "z"
try:
    
    def test_1(a):
        if a=="s":
            return "s"
        else:
            return "z"
except Exception as e:
    print(e)

In [14]:
df["col_6"] = df["col5"].apply(test_1)

In [15]:
df

   col1  col2      col3  col4 col5  col4_4 col_6
0     1    45  sudhansu     1    s       1     s
1     2    56     kumar     4    k       4     z
2     3    67     sumay     9    s       9     s
3     4    34     Krish    16    K      16     z
4     5    34      naik    25    n      25     z

In [16]:
df["col_6_of_6"] = df["col5"].apply(lambda a:"s" if a=="s" else "z")

In [17]:
df

   col1  col2      col3  col4 col5  col4_4 col_6 col_6_of_6
0     1    45  sudhansu     1    s       1     s          s
1     2    56     kumar     4    k       4     z          z
2     3    67     sumay     9    s       9     s          s
3     4    34     Krish    16    K      16     z          z
4     5    34      naik    25    n      25     z          z

In [18]:
def test_3(a):
    return len(a)

In [20]:
df["co_7"] = df["col3"].apply(test_3)

In [21]:
df

   col1  col2      col3  col4 col5  col4_4 col_6 col_6_of_6  co_7
0     1    45  sudhansu     1    s       1     s          s     8
1     2    56     kumar     4    k       4     z          z     5
2     3    67     sumay     9    s       9     s          s     5
3     4    34     Krish    16    K      16     z          z     5
4     5    34      naik    25    n      25     z          z     4

In [26]:
import math

In [28]:
df["col_8"]=df["col2"].apply(math.log)

In [29]:
df

   col1  col2      col3  col4 col5  col4_4 col_6 col_6_of_6  co_7     col_8
0     1    45  sudhansu     1    s       1     s          s     8  3.806662
1     2    56     kumar     4    k       4     z          z     5  4.025352
2     3    67     sumay     9    s       9     s          s     5  4.204693
3     4    34     Krish    16    K      16     z          z     5  3.526361
4     5    34      naik    25    n      25     z          z     4  3.526361

# Numpy

In [2]:
import numpy as np

In [3]:
# arrray are equivalient to list

SyntaxError: invalid syntax (1651103922.py, line 1)

In [4]:
l=["sumay",1,2,3,4]

In [5]:
type(l)

list

In [6]:
np.array(l)

array(['sumay', '1', '2', '3', '4'], dtype='<U11')

In [7]:
type(np.array(l))

numpy.ndarray

In [8]:
np.array([1,2,3,4.0])

array([1., 2., 3., 4.])

In [9]:
np.array([1,2,3,4.2])

array([1. , 2. , 3. , 4.2])

In [10]:
np.array([[1,2],[3,4]])

array([[1, 2],
       [3, 4]])

In [11]:
a = np.array([[1,2],[3,4]])

In [12]:
a

array([[1, 2],
       [3, 4]])

In [13]:
a[1]

array([3, 4])

In [14]:
a[1][1]

4

In [15]:
np.array([1,2,3,4],ndmin=0)

array([1, 2, 3, 4])

In [16]:
np.array([1,2,3,4],ndmin=2)

array([[1, 2, 3, 4]])

In [17]:
np.array([1,2,3,4],ndmin=3)

array([[[1, 2, 3, 4]]])

In [18]:
np.array([1,2,3,4],ndmin=4)

array([[[[1, 2, 3, 4]]]])

In [19]:
a2=np.array([1,2,3,4],ndmin=4)

In [20]:
a2

array([[[[1, 2, 3, 4]]]])

In [21]:
a2[0][0]

array([[1, 2, 3, 4]])

In [22]:
a2[0][0][0][0]

1

In [23]:
np.asarray([1,2,3,4,5])

array([1, 2, 3, 4, 5])

In [24]:
np.asanyarray([1,2,3,4,5])

array([1, 2, 3, 4, 5])

In [25]:
np.mat([1,2,3,4,5])

matrix([[1, 2, 3, 4, 5]])

In [26]:
# Array can have the nth given dimension whereas matrix have minimum 2D

In [27]:
a=[1,2,3,4,5,6]
np.asarray(a)

array([1, 2, 3, 4, 5, 6])

In [28]:
np.mat(a)

matrix([[1, 2, 3, 4, 5, 6]])

In [29]:
np.asanyarray(a)

array([1, 2, 3, 4, 5, 6])

In [30]:
np.asanyarray(np.mat(a))

matrix([[1, 2, 3, 4, 5, 6]])

In [31]:
np.fromfunction(lambda i,j : i==j, (3,3))

array([[ True, False, False],
       [False,  True, False],
       [False, False,  True]])

In [32]:
np.fromfunction(lambda i,j : i==j, (3,4))

array([[ True, False, False, False],
       [False,  True, False, False],
       [False, False,  True, False]])

In [33]:
np.fromfunction(lambda i,j : i==j, (2,3))

array([[ True, False, False],
       [False,  True, False]])

In [34]:
np.fromfunction(lambda i,j : i*j, (4,4))

array([[0., 0., 0., 0.],
       [0., 1., 2., 3.],
       [0., 2., 4., 6.],
       [0., 3., 6., 9.]])

In [35]:
np.fromfunction(lambda i,j : i*j, (4,4), dtype = int)

array([[0, 0, 0, 0],
       [0, 1, 2, 3],
       [0, 2, 4, 6],
       [0, 3, 6, 9]])

In [36]:
# Matrix is sub-class of array

In [46]:
b=["raja","hi",[1,2,3]]
np.asanyarray(b)

C:\Users\win11\AppData\Local\Temp\ipykernel_21968\3237831660.py:2: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  np.asanyarray(b)

array(['raja', 'hi', list([1, 2, 3])], dtype=object)

In [48]:
np.fromfunction(lambda i,j,z : i*j*z, (3,3,3), dtype = int)

array([[[0, 0, 0],
        [0, 0, 0],
        [0, 0, 0]],

       [[0, 0, 0],
        [0, 1, 2],
        [0, 2, 4]],

       [[0, 0, 0],
        [0, 2, 4],
        [0, 4, 8]]])

In [49]:
np.fromfunction(lambda i,j,z : i*j*z, (3,3,2), dtype =int)

array([[[0, 0],
        [0, 0],
        [0, 0]],

       [[0, 0],
        [0, 1],
        [0, 2]],

       [[0, 0],
        [0, 2],
        [0, 4]]])

In [57]:
a=np.fromfunction(lambda i,j,z,p : i*j*z*p, (2,3,4,3), dtype =int)

In [58]:
a

array([[[[ 0,  0,  0],
         [ 0,  0,  0],
         [ 0,  0,  0],
         [ 0,  0,  0]],

        [[ 0,  0,  0],
         [ 0,  0,  0],
         [ 0,  0,  0],
         [ 0,  0,  0]],

        [[ 0,  0,  0],
         [ 0,  0,  0],
         [ 0,  0,  0],
         [ 0,  0,  0]]],


       [[[ 0,  0,  0],
         [ 0,  0,  0],
         [ 0,  0,  0],
         [ 0,  0,  0]],

        [[ 0,  0,  0],
         [ 0,  1,  2],
         [ 0,  2,  4],
         [ 0,  3,  6]],

        [[ 0,  0,  0],
         [ 0,  2,  4],
         [ 0,  4,  8],
         [ 0,  6, 12]]]])

In [60]:
a.size

72

In [59]:
a.ndim

4

In [61]:
a.shape

(2, 3, 4, 3)

In [62]:
a.dtype

dtype('int32')

In [66]:
a=np.fromfunction(lambda i,j : i*j, (4,3), dtype =int)

In [67]:
a

array([[0, 0, 0],
       [0, 1, 2],
       [0, 2, 4],
       [0, 3, 6]])

In [68]:
pd.DataFrame(a)

   0  1  2
0  0  0  0
1  0  1  2
2  0  2  4
3  0  3  6

In [69]:
a=np.fromfunction(lambda i,j : i*j, (400,300), dtype =int)

In [71]:
a

array([[     0,      0,      0, ...,      0,      0,      0],
       [     0,      1,      2, ...,    297,    298,    299],
       [     0,      2,      4, ...,    594,    596,    598],
       ...,
       [     0,    397,    794, ..., 117909, 118306, 118703],
       [     0,    398,    796, ..., 118206, 118604, 119002],
       [     0,    399,    798, ..., 118503, 118902, 119301]])

In [70]:
pd.DataFrame(a)

,0,1,2,3,4,5,6,7,8,9,...,290,291,292,293,294,295,296,297,298,299
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,1,2,3,4,5,6,7,8,9,...,290,291,292,293,294,295,296,297,298,299
2,0,2,4,6,8,10,12,14,16,18,...,580,582,584,586,588,590,592,594,596,598
3,0,3,6,9,12,15,18,21,24,27,...,870,873,876,879,882,885,888,891,894,897
4,0,4,8,12,16,20,24,28,32,36,...,1160,1164,1168,1172,1176,1180,1184,1188,1192,1196
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
395,0,395,790,1185,1580,1975,2370,2765,3160,3555,...,114550,114945,115340,115735,116130,116525,116920,117315,117710,118105
396,0,396,792,1188,1584,1980,2376,2772,3168,3564,...,114840,115236,115632,116028,116424,116820,117216,117612,118008,118404
397,0,397,794,1191,1588,1985,2382,2779,3176,3573,...,115130,115527,115924,116321,116718,117115,117512,117909,118306,118703
398,0,398,796,1194,1592,1990,2388,2786,3184,3582,...,115420,115818,116216,116614,117012,117410,117808,118206,118604,119002
399,0,399,798,1197,1596,1995,2394,2793,3192,3591,...,115710,116109,116508,116907,117306,117705,118104,118503,118902,119301

In [73]:
np.random.rand(100,4)

array([[0.70995354, 0.02914574, 0.19373944, 0.9180294 ],
       [0.36341738, 0.72976424, 0.54336466, 0.16357802],
       [0.00667308, 0.50542201, 0.42981313, 0.1988347 ],
       [0.14627755, 0.11549932, 0.51853082, 0.51961159],
       [0.86543176, 0.87363709, 0.98240817, 0.61627436],
       [0.55500738, 0.80359658, 0.26286531, 0.57055357],
       [0.80708663, 0.41751694, 0.28295557, 0.41241686],
       [0.89578459, 0.84318626, 0.59709483, 0.50363075],
       [0.74235067, 0.7366551 , 0.98718921, 0.07635639],
       [0.7900352 , 0.47640524, 0.78014908, 0.92049889],
       [0.45960424, 0.37961488, 0.54720164, 0.20595418],
       [0.80255512, 0.31345074, 0.75428257, 0.19741735],
       [0.09429762, 0.56939948, 0.74416373, 0.94657062],
       [0.28737548, 0.993427  , 0.96804127, 0.31644429],
       [0.58033464, 0.92810123, 0.22923413, 0.61372205],
       [0.5713556 , 0.91092976, 0.96827075, 0.79538088],
       [0.99182922, 0.81781924, 0.77231876, 0.52381628],
       [0.100918  , 0.71560338, 0.78568478, 0.43318188],
       [0.28714459, 0.26789658, 0.07741999, 0.71898723],
       [0.00536849, 0.7858416 , 0.06481419, 0.23390553],
       [0.19483231, 0.16661453, 0.60626018, 0.21199351],
       [0.1846459 , 0.5851208 , 0.36858273, 0.36409742],
       [0.03064594, 0.37907989, 0.860126  , 0.62484451],
       [0.25358758, 0.35744801, 0.36672151, 0.24596772],
       [0.74503392, 0.10889735, 0.27825078, 0.73078734],
       [0.9724681 , 0.37303697, 0.394968  , 0.1915426 ],
       [0.14590352, 0.48314688, 0.41207498, 0.84767987],
       [0.81548093, 0.61215981, 0.50375708, 0.74376331],
       [0.28594562, 0.85316087, 0.1384395 , 0.03819424],
       [0.56671262, 0.68581402, 0.1725053 , 0.70475311],
       [0.75684312, 0.64826498, 0.30218608, 0.07194049],
       [0.10278459, 0.02896437, 0.56353225, 0.85249787],
       [0.15158322, 0.84638363, 0.03112815, 0.00298551],
       [0.05447581, 0.0441696 , 0.38235206, 0.23295196],
       [0.04200985, 0.91552952, 0.03340453, 0.3777321 ],
       [0.10005632, 0.1778872 , 0.37636384, 0.24903522],
       [0.84109227, 0.96303393, 0.67290861, 0.71633893],
       [0.17235611, 0.4718427 , 0.10153391, 0.38919736],
       [0.30697523, 0.63886407, 0.70157208, 0.63347197],
       [0.36256649, 0.2733713 , 0.89460702, 0.83408936],
       [0.82559139, 0.06530984, 0.703049  , 0.35757188],
       [0.34196772, 0.50090285, 0.03753128, 0.36228873],
       [0.63750185, 0.40293933, 0.4296854 , 0.86636454],
       [0.96315919, 0.49162912, 0.41566378, 0.32399162],
       [0.32482558, 0.39812959, 0.9249817 , 0.22051489],
       [0.39612103, 0.17308333, 0.34183121, 0.48916478],
       [0.73750695, 0.38861459, 0.16393023, 0.53544799],
       [0.05816391, 0.92234201, 0.54655199, 0.5391561 ],
       [0.35207582, 0.68832938, 0.84292051, 0.19239718],
       [0.97810578, 0.63090792, 0.78809658, 0.09900748],
       [0.42674993, 0.73154247, 0.77566708, 0.48367128],
       [0.6332061 , 0.7369139 , 0.40225961, 0.16707768],
       [0.80087415, 0.79428883, 0.85216272, 0.77383876],
       [0.32680593, 0.38385722, 0.90727374, 0.07724003],
       [0.6398811 , 0.56597356, 0.21798296, 0.51749764],
       [0.48758325, 0.46411258, 0.76639765, 0.40849541],
       [0.00565743, 0.50238483, 0.91872369, 0.87361422],
       [0.54455513, 0.70249758, 0.23180605, 0.91643723],
       [0.27733688, 0.44080965, 0.05744251, 0.40276563],
       [0.86355741, 0.98626511, 0.69354783, 0.22783888],
       [0.03179222, 0.52241082, 0.218224  , 0.92100927],
       [0.31692806, 0.90580578, 0.72982958, 0.02957316],
       [0.30119384, 0.78080894, 0.54919957, 0.49190235],
       [0.64148517, 0.64896903, 0.2076188 , 0.81981713],
       [0.31551197, 0.29670928, 0.38930532, 0.51901838],
       [0.27420091, 0.79660625, 0.57729391, 0.31323193],
       [0.7373471 , 0.28072274, 0.24034407, 0.17631429],
       [0.63087808, 0.94060643, 0.47749613, 0.85964499],
       [0.69195229, 0.0155854 , 0.37743159, 0.8509781 ],
       [0.74762717, 0.99200963, 0.47611434, 0.87027634],
       [0.17907408, 0.63926014, 0.81335153, 0.89856457],
       [0.35506435, 0.22533408, 0.65266316, 0.87150876],
       [0.1182467 , 0.37946014, 0.33756683, 0.97819574],
       [0.50240885, 0.08532035, 0.55778977, 0.33059813],
       [0.27180128, 0.19399675, 0.68680624, 0.74302673],
       [0.26214587, 0.05833503, 0.19751246, 0.93544708],
       [0.5846061 , 0.06395839, 0.03742302, 0.53234332],
       [0.34887721, 0.84715535, 0.57681232, 0.82158659],
       [0.24538341, 0.78894914, 0.69033505, 0.35235008],
       [0.44906681, 0.0162189 , 0.23280773, 0.52299123],
       [0.73986206, 0.73821059, 0.54643976, 0.52582305],
       [0.65677031, 0.7078088 , 0.28130088, 0.36068684],
       [0.80741319, 0.73157274, 0.09795121, 0.33333285],
       [0.70963107, 0.46956269, 0.93448812, 0.51418948],
       [0.0042368 , 0.10613752, 0.83718102, 0.98923278],
       [0.72426357, 0.179496  , 0.17269288, 0.57673108],
       [0.39974015, 0.89613043, 0.8661058 , 0.44276852],
       [0.64299118, 0.75400168, 0.69840882, 0.77253185],
       [0.89464744, 0.7925209 , 0.27429441, 0.99122582],
       [0.23629138, 0.07385489, 0.87612389, 0.40458644],
       [0.92239034, 0.73440512, 0.63718933, 0.72332356],
       [0.56719372, 0.41680117, 0.94101039, 0.68606853],
       [0.08439012, 0.40048881, 0.02117942, 0.38192278],
       [0.48041274, 0.25253259, 0.39738168, 0.43746568],
       [0.18764061, 0.7310958 , 0.67089527, 0.36441586],
       [0.58201008, 0.1977781 , 0.0302198 , 0.19877918],
       [0.09716981, 0.96308138, 0.1407134 , 0.87615302],
       [0.20397878, 0.70238432, 0.04311375, 0.02508087],
       [0.88073274, 0.93210253, 0.59084739, 0.64856996],
       [0.42321175, 0.61814744, 0.20242141, 0.66432155]])

In [84]:
np.random.randint(5,50)

20

In [89]:
np.random.randn(4,5)

array([[ 0.22894465, -0.42646048, -1.27562582,  0.29325541,  1.57765389],
       [ 0.58476686, -0.99010262,  0.85709646, -0.39824934, -0.4846553 ],
       [ 1.13658915,  0.26247921,  2.35544467,  1.35720205, -0.16266424],
       [-0.1437568 , -2.01975142,  0.05043799, -0.83109515,  0.56108625]])

In [90]:
pd.DataFrame(np.random.randn(4,5))

          0         1         2         3         4
0  0.190405 -0.480095 -0.083191  0.136720  1.109273
1 -0.357326  1.564821  1.260428  0.528554  1.213559
2  1.663981 -0.213075  0.579968 -1.204549 -0.146163
3 -0.028711  0.824192 -0.806078 -0.371033 -0.465836

In [ ]:
np.fromfunction(lambda i,j,z : i*j*z, (3,3,2), dtype =int)

In [97]:
a=np.fromfunction(lambda i,j,z : i*j*z, (4,5,6), dtype =int)

In [98]:
a

array([[[ 0,  0,  0,  0,  0,  0],
        [ 0,  0,  0,  0,  0,  0],
        [ 0,  0,  0,  0,  0,  0],
        [ 0,  0,  0,  0,  0,  0],
        [ 0,  0,  0,  0,  0,  0]],

       [[ 0,  0,  0,  0,  0,  0],
        [ 0,  1,  2,  3,  4,  5],
        [ 0,  2,  4,  6,  8, 10],
        [ 0,  3,  6,  9, 12, 15],
        [ 0,  4,  8, 12, 16, 20]],

       [[ 0,  0,  0,  0,  0,  0],
        [ 0,  2,  4,  6,  8, 10],
        [ 0,  4,  8, 12, 16, 20],
        [ 0,  6, 12, 18, 24, 30],
        [ 0,  8, 16, 24, 32, 40]],

       [[ 0,  0,  0,  0,  0,  0],
        [ 0,  3,  6,  9, 12, 15],
        [ 0,  6, 12, 18, 24, 30],
        [ 0,  9, 18, 27, 36, 45],
        [ 0, 12, 24, 36, 48, 60]]])

In [103]:
a.reshape(12,10)

array([[ 0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
       [ 0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
       [ 0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
       [ 0,  0,  0,  0,  0,  0,  0,  1,  2,  3],
       [ 4,  5,  0,  2,  4,  6,  8, 10,  0,  3],
       [ 6,  9, 12, 15,  0,  4,  8, 12, 16, 20],
       [ 0,  0,  0,  0,  0,  0,  0,  2,  4,  6],
       [ 8, 10,  0,  4,  8, 12, 16, 20,  0,  6],
       [12, 18, 24, 30,  0,  8, 16, 24, 32, 40],
       [ 0,  0,  0,  0,  0,  0,  0,  3,  6,  9],
       [12, 15,  0,  6, 12, 18, 24, 30,  0,  9],
       [18, 27, 36, 45,  0, 12, 24, 36, 48, 60]])

In [104]:
pd.DataFrame(a.reshape(12,10))

     0   1   2   3   4   5   6   7   8   9
0    0   0   0   0   0   0   0   0   0   0
1    0   0   0   0   0   0   0   0   0   0
2    0   0   0   0   0   0   0   0   0   0
3    0   0   0   0   0   0   0   1   2   3
4    4   5   0   2   4   6   8  10   0   3
5    6   9  12  15   0   4   8  12  16  20
6    0   0   0   0   0   0   0   2   4   6
7    8  10   0   4   8  12  16  20   0   6
8   12  18  24  30   0   8  16  24  32  40
9    0   0   0   0   0   0   0   3   6   9
10  12  15   0   6  12  18  24  30   0   9
11  18  27  36  45   0  12  24  36  48  60

In [106]:
# in 4-D
a.reshape(12,5,2)

array([[[ 0,  0],
        [ 0,  0],
        [ 0,  0],
        [ 0,  0],
        [ 0,  0]],

       [[ 0,  0],
        [ 0,  0],
        [ 0,  0],
        [ 0,  0],
        [ 0,  0]],

       [[ 0,  0],
        [ 0,  0],
        [ 0,  0],
        [ 0,  0],
        [ 0,  0]],

       [[ 0,  0],
        [ 0,  0],
        [ 0,  0],
        [ 0,  1],
        [ 2,  3]],

       [[ 4,  5],
        [ 0,  2],
        [ 4,  6],
        [ 8, 10],
        [ 0,  3]],

       [[ 6,  9],
        [12, 15],
        [ 0,  4],
        [ 8, 12],
        [16, 20]],

       [[ 0,  0],
        [ 0,  0],
        [ 0,  0],
        [ 0,  2],
        [ 4,  6]],

       [[ 8, 10],
        [ 0,  4],
        [ 8, 12],
        [16, 20],
        [ 0,  6]],

       [[12, 18],
        [24, 30],
        [ 0,  8],
        [16, 24],
        [32, 40]],

       [[ 0,  0],
        [ 0,  0],
        [ 0,  0],
        [ 0,  3],
        [ 6,  9]],

       [[12, 15],
        [ 0,  6],
        [12, 18],
        [24, 30],
        [ 0,  9]],

       [[18, 27],
        [36, 45],
        [ 0, 12],
        [24, 36],
        [48, 60]]])

In [107]:
b=np.fromfunction(lambda a,b,c : a+b+c,(3,4,5),dtype=int)

In [108]:
b

array([[[0, 1, 2, 3, 4],
        [1, 2, 3, 4, 5],
        [2, 3, 4, 5, 6],
        [3, 4, 5, 6, 7]],

       [[1, 2, 3, 4, 5],
        [2, 3, 4, 5, 6],
        [3, 4, 5, 6, 7],
        [4, 5, 6, 7, 8]],

       [[2, 3, 4, 5, 6],
        [3, 4, 5, 6, 7],
        [4, 5, 6, 7, 8],
        [5, 6, 7, 8, 9]]])

In [110]:
pd.DataFrame(b)

ValueError: Must pass 2-d input. shape=(3, 4, 5)

In [118]:
# -(negative) is a deaufault value---- to take 
b.reshape(12,-1)

array([[0, 1, 2, 3, 4],
       [1, 2, 3, 4, 5],
       [2, 3, 4, 5, 6],
       [3, 4, 5, 6, 7],
       [1, 2, 3, 4, 5],
       [2, 3, 4, 5, 6],
       [3, 4, 5, 6, 7],
       [4, 5, 6, 7, 8],
       [2, 3, 4, 5, 6],
       [3, 4, 5, 6, 7],
       [4, 5, 6, 7, 8],
       [5, 6, 7, 8, 9]])

In [123]:
pd.DataFrame(b.reshape(5,12))

   0   1   2   3   4   5   6   7   8   9   10  11
0   0   1   2   3   4   1   2   3   4   5   2   3
1   4   5   6   3   4   5   6   7   1   2   3   4
2   5   2   3   4   5   6   3   4   5   6   7   4
3   5   6   7   8   2   3   4   5   6   3   4   5
4   6   7   4   5   6   7   8   5   6   7   8   9

In [124]:
list(range(4,10,2))

[4, 6, 8]

In [125]:
list(range(4,10,.2))

TypeError: 'float' object cannot be interpreted as an integer

In [127]:
np.arange(4,10,0.2)

array([4. , 4.2, 4.4, 4.6, 4.8, 5. , 5.2, 5.4, 5.6, 5.8, 6. , 6.2, 6.4,
       6.6, 6.8, 7. , 7.2, 7.4, 7.6, 7.8, 8. , 8.2, 8.4, 8.6, 8.8, 9. ,
       9.2, 9.4, 9.6, 9.8])

In [132]:
a = np.array([[1,2], [3,4]])
b = np.array([[2,3], [4,5]])

In [133]:
a

array([[1, 2],
       [3, 4]])

In [134]:
b

array([[2, 3],
       [4, 5]])

In [135]:
a*b

array([[ 2,  6],
       [12, 20]])

In [136]:
# to do matrix multiplication
a@b

array([[10, 13],
       [22, 29]])

In [137]:
m=a@b

In [138]:
m

array([[10, 13],
       [22, 29]])

In [139]:
m/0

C:\Users\win11\AppData\Local\Temp\ipykernel_21968\3791875896.py:1: RuntimeWarning: divide by zero encountered in true_divide
  m/0

array([[inf, inf],
       [inf, inf]])